[{"name": "Albuquerque Adult Learning Center (ABQ-GED)", "description": "Albuquerque Adult Learning Center, Inc. (formerly ABQ-GED®), is an award-winning Education Program providing FREE Adult Basic Education (ABE) and High School Equivalency (HSE) preparation classes to needy communities within the Albuquerque Metro area. ABQ ALC collaborates with multiple community partners to support HSE completers in their transition to college or employment.  This grant will increase our Fast Track Program that allows HSE students to complete their program faster and at lower cost, thus increasing the total number of graduates in Bernalillo County and providing major economic benefits to our poorest communities."}, {"name": "Reading Works", "description": "Reading Works provides free literacy tutoring to adult residents of Bernalillo County. Trained volunteers provide one-on-one or small group tutoring in reading, writing, math, computer skills and English as a Second Language. Our goal is to give adults the skills they need to become economically self-sufficient, to support their children, and to participate in the community.  Reading Works stands out for innovative programming.  The Library of Congress named Reading Works a 2017 Best Practices in Literacy Honoree for our curriculum titled \"12 Weeks to Reading.\"  We were one of 15 programs from five countries to be honored./n/nReading Works provides free tutoring to adults in reading, writing, and English as a Second Language. We also teach computer skills and math.  Our program helps adult learners overcome barriers to success.  In 2017 the Library of Congress named Reading Works a  Best Practices in Literacy Honoree, one of 18 programs from six countries honored."}, {"name": "APS Education Foundation", "description": "Homeless students in the Albuquerque Public Schools are those who are living in emergency shelters; living in cars, parks, public spaces, abandoned buildings, substandard housing, bus or train stations; places not designed for use as a regular sleeping accommodation for human beings, and doubled up with others due to economic hardship. There are homeless children and youth attending kindergarten through 12th grades. High-risk students have the most to gain from after-school and summer programs in terms of educational opportunity--encouraging and tracking participation across the year helps youth stay engaged (Harvard Research, 2011). Creating structured environments for at-risk students to improve their literacy skills, receive enrichment activities and learn about careers provides students with additional support to be successful in school. After-school and summer programs also allow students to strengthen their social skills and friendships with peers. This enhances their support system at school. Improving academic outcomes for these students is important for educators and policymakers./n/nThe Homeless Project's after-school tutoring and summer programs will provide academic, enrichment and career development activities for approximately 335 students (185 during the school year, 150 during the summer) homeless students during 2018-2019. The programs will be located in a number of schools/n/nthroughout the city.  Academic skills in literacy will be enhanced using a Links to Literacy approach. Links to Literacy is a best practice approach which includes the following four components: 1) The tutor reads, 2) The child reads, 3) Word study, 4) The child writes./n/nEnrichment activities will also be offered during our after-school and summer programs. These will include:/n/n1) Health and Physical Fitness Instruction provided by community volunteers,/n/n2) Monthly Birthday Celebrations provided by Community Volunteers,/n/n3) Family style catered meals where students receive nourishment, mentorship, and support from caring adults, and/n/n4) Art instruction during our summer program.  In addition to these activities, we are also exploring theater and music activities to add to our programs in the coming year./n/nAfter-school and summer programs will also emphasize staying in school and understanding the connections between performance in school and future endeavors. Community guest speakers and field trips will address a multitude of professional careers open to students and demystify unfamiliar careers./n/nThe Homeless Project's after-school tutoring and summer programs will positively impact students in the following ways:/n/n1) Increase their literacy skills/n/n2) Provide certified teachers and school personnel to guide and mentor students/n/n3) Provide snacks and catered meals to students during each session/n/n4) Provide experiential learning opportunities with transportation to and from sites/n/n5) Provide career awareness through field trips and enrichment activities/n/n6) Provide art instruction, physical fitness activities, art instruction, and birthday celebrations through community collaborations."}, {"name": "New Mexico Community Aids Partnership", "description": "The New Mexico Community AIDS Partnership (NMCAP) was founded in 1993 and works to assure that the diverse populations of New Mexico receive high quality, culturally appropriate HIV prevention, education and care.  We focus on innovative and collaborative programs, targeting otherwise underserved and vulnerable populations.  /n/nThis project is designed to fill gaps in service and increase regional capacity for HIV prevention, education and services. We complete an annual needs assessment and confer with  local providers of HIV services and community members to assure that our work is addressing the most urgent community needs and does not duplicate other efforts."}, {"name": "Albuquerque Center for Hope and Recovery", "description": "The mission of the Albuquerque Center for Hope & Recovery (ACHR) is to support people who live with mental health or co-occurring mental health and substance abuse challenges. Through peer support, in a safe environment, ACHR aims to help people experience positive life growth by focusing on hope, humor and personal responsibility."}, {"name": "Heading Home", "description": "Albuquerque Heading Home is a Housing First collaboration of public, private and non-profit organizations with the mission of ending homelessness for individuals who have been chronically homeless and are medically vulnerable. More than 700 individuals and family members have been placed in stable, safe, healthy and supportive housing since 2011."}, {"name": "Albuquerque Healthcare for the Homeless", "description": "The AHCH Resource Center (RC) addresses immediate basic needs and reduces harmful affects of homelessness for nearly 2,000 people annually. This innovative space ties directly to primary care to identify and treat chronic health needs onsite while linking to other supportive services that address and end their homelessness."}, {"name": "Career Guidance Institute", "description": "Albuquerque Reads is the sole program of the Career Guidance Institute. The population ABQ Reads works with is considered 'vulnerable' primarily due to the effects of poverty. The most recent data shows that two-thirds of ABQ Reads students come from poverty backgrounds. The program serves in three, public elementary schools, which are all Title I schools and, are are further qualified under the Community Eligible Provision which is applied to schools with very high poverty levels.   The majority of the students served by the program are minorities./n/nEvidence of the community's need for early support and intervention literacy services is reflected in the fact that nearly half of New Mexico's adult population is considered functionally illiterate. This severely hampers their ability to secure well-paying jobs that can support themselves and their families. This problem is best addressed early in the education process before issues become permanent.  The need becomes more apparent when beginning-of-year literacy scores are evaluated. These scores show that there are significantly more students starting the year at the lowest reading level and significantly less students reading at the highest level when compared to other district schools./n/nABQ Reads' unique method is evident in a few ways. ABQ Reads is the only program in the state to provide individual tutoring during the school day and in conjunction with classroom learning. It is also offered at no charge to every enrolled kindergarten student. The tutoring sessions take place three times per week for thirty minutes each. A volunteer tutor is paired with a student so that every child receives ninety minutes of individualized attention.  It is also unique in that it has developed its own curriculum. The curriculum can be tailored by each site coordinator to follow exactly what has been taught in the classroom. It has easy-to-use examples and prompts for the volunteer tutors so that they and the children get the most out of each session. Another unique aspect is the allowance for individual differences and varying academic levels of the students. Because of the one-to-one nature of the program, every session can meet the students' needs and help them continue to progress upward.  Regardless of the level of any student, the program meets them where they are, and they do experience success./n/nThe impact to the community is immediate and long-term. The immediate impact can be seen in that these at-risk youth are given access to an academic foundation-building program. A strong academic foundation, especially in the area of literacy, is essential for all future learning and provides an immediate return on investment as children benefiting from the program show more gains and are better prepared for first grade. The long-term impact is seen in that students who experience successes early in their schooling have an increased likelihood of graduating from high school, pursuing higher learning, and transitioning smoothly into productive adulthood."}, {"name": "Share Your Care", "description": "Alivio is an internal funding stream that provides Adult Day Services for low- income, under/uninsured frail, elderly, disabled, and vulnerable adults and seniors in need of services but who do not qualify for funding and can't afford to pay for services privately. Alivio also provides Respite and support for their Family Members and Caregivers."}, {"name": "Amy Biehl High School Foundation", "description": "Through Amy Biehl High School (ABHS) all-school services projects, supported financially by the ABHS Foundation, students learn to research local needs and address them through volunteer hours dedicated to hundreds of area nonprofits./n/nVULNERABLE POPULATION: ABHS attracts students from diverse backgrounds. Currently, 300 students are enrolled in grades 9-12. Of these, 60% are minorities, 24% have special education needs (9% higher than the Albuquerque District average), and over 55% qualify for Free or Reduced Lunch (meaning they are low-or moderate-income). Many parents choose ABHS because of a reputation for excellence, as well as the mission to serve. More than 140 community partners have hosted students, including museums, health service providers, and animal rescue agencies. These agencies often serve vulnerable populations themselves and they benefit from ABHS student involvement. Agencies form long-term relationships with students; over 50% of ABHS graduates continue to volunteer, extending their community impact for years beyond high school./n/nNEED: Many ABHS students face risk factors that increase the likelihood of dropping out of high school (e.g., low-income, entering school behind grade level, special needs). Further, they may enter high school without the familial supports that help them succeed and understand the importance of college. Local nonprofits often struggle with limited budgets and variable volunteer capacity; our students fill a need for well-informed and committed volunteers. Through their contributions to the community, ABHS students support greater capacity in local nonprofits that serve thousands of high-need clients. ABHS student volunteering, therefore, benefits central New Mexico widely./n/nMETHOD OF SERVICE PROVISION: ABHS service programming is well-established and ongoing, supported by teachers, advisors, and nonprofit partners. The experience begins in 9th-10th grades with all-school service days (students select partners) and intensifies in 11th grade with a Compass class (students identify talents/interests and develop an aligning project). They then foster the connections they need to carry out their projects. In 12th grade, students execute their projects overseen by nonprofit mentors and ABHS staff and executed at partner nonprofit sites. Through Advisories, students meet in groups throughout their time in high school to discuss service experiences and link them to larger lessons about themselves and their academic and career trajectories. Seniors are required to participate in college preparatory work and pass college courses relevant to their service project. ABHS staff is responsible for ensuring that students are on track with coursework and service commitments, that they have adequate oversight, and that nonprofit partners receive the support they need./n/nIMPACT: Each year, ABHS students commit over 10,000 service hours to nonprofits around the Albuquerque area, expanding capacity to serve clients at cash-strapped nonprofits and lending the insights and energy of students. Further, ABHS has worked with other area schools to train them in service methods to expand the postive impact beyond ABHS students./n/nOur approach is even more important for the students themselves. For those who enter high school without strong support systems and/or who struggle academically, the service focus is empowering. Students find that they can have a direct impact on the lives of others, energizing them to do more and stay in school. Our approach enhances teen’s social intelligence through gaining knowledge about local needs and making community connections, as well as improving emotional intelligence by identifying and working with vulnerable populations while they analyze the impact of their service on themselves./n/nFor years, ABHS has earned an ‘A’ on the state report card for College and Career Readiness, signaling a strong ability to prepare students for college/careers."}, {"name": "APS Education Foundation-Community Clothing Bank", "description": "Vulnerable Population Served:/n/nThe APS Community Clothing Bank serves the members of our community who are most vulnerable: children living in poverty. In Albuquerque Public Schools, nearly 69% of children qualify for free or reduced price lunch, or over 57,500 students. To put this in context, a family of three qualifying for free lunch makes less than $26,000 a year. Imagine being a parent with just over $2,000 a month to pay for rent, utilities, transportation, food and clothes. It is clear that for many, the math just does not add up. The APS Community Clothing Bank exists to ensure that no child has to miss school due to the lack of clothes or shoes./n/nCommunity Need for Program:/n/nJust like food banks, clothing banks are organized to meet a basic need of Albuquerque’s children. Over the past decade, Albuquerque has seen increasing rates of poverty and higher demand for Clothing Bank services. Starting in 2013, new partnerships with Goodwill Industries of New Mexico and Payless Shoe Source allowed the APS Community Clothing Bank to increase the number of students being served from hundreds to thousands. In 2016-2017, the Clothing Bank served 2,775 students, a new record. In 2017-2018, the Clothing Bank had already served over 2,200 by mid-year./n/nMethod of Service Provision:/n/nStudents needing help with clothing are identified in a number of ways. Sometimes, teachers notice students coming to school without a winter coat or with ragged shoes. Sometimes, parents and older students request help with clothes directly. And sometimes, attendance officers discover the real reason students aren’t coming to school is that they are embarrassed by their clothes. When this happens, a school liaison fills out an online request form. Within seven days, the Clothing Bank delivers a package with 6 pairs of new socks, 6 pairs of underwear, a hoody or light jacket, clothing vouchers for three outfits at Goodwill Industries of New Mexico and if needed, a voucher for a new pair of shoes from Payless Shoe Source.  In total students are eligible for up to three Goodwill clothing vouchers (or 9 outfits), two sets of new socks and underwear, and one shoe card per school year./n/nThanks to a partnership with Goodwill Industries of New Mexico, the clothing vouchers are provided free of cost. Goodwill stores are open evenings and weekends and are located near bus lines throughout the city, which takes advantage of existing distribution networks and saves thousands of dollars annually. Similarly, shoe vouchers, while not free, are very cost effective and allow students the dignity of choosing their own shoes. /n/nThe APS Community Clothing Bank also partners with the Assistance League’s Operation School Bell, which focuses on providing shoes and uniforms at the thirty-five (35) APS Title I elementary schools and middle schools at which uniforms are required. If a student at a uniform school needs shoes or clothes, he or she is referred to the Assistance League and not the APS Community Clothing Bank. The thousands of students served by the APS Community Clothing Bank each year are in addition to the thousands served by the Assistance League and the organizations work hard to ensure they are never duplicating each other’s work./n/nImpact of the Program:/n/nChronic absenteeism is one of the strongest predictors of school failure researchers have seen. Students who miss more than two days of school a month, or about 10% of the year, are more likely not to read on grade level. Many times, chronic absenteeism is related to a lack of appropriate school clothing. If a child doesn’t have a warm winter coat on a cold day, he or she most likely won’t show up at school. A teenager embarrassed about wearing yesterday’s dirty clothes or last year’s too-small shoes faces just one more barrier to overcome. If funded by the United Way, the Clothing Bank will help Albuquerque reduce chronic absenteeism and have more students in school ready to learn each day."}, {"name": "ARCA", "description": "ARCA's tradition of providing stellar supports to people with disabilities began in 1957. ARCA's caring and expertly trained staff help hundreds of children and adults successfully live their dreams, work, learn, have fun and develop friends while enjoying health, safety and happiness.  For six decades,  ARCA has provided opportunities for individuals to lead meaningful lives and continues to work together to open doors for people with intellectual and developmental disabilities to be valued members of the community./n/nLaunched in 1978, ARCA Foster Care Services is the only resource for specialized foster care in New Mexico. This program trains, licenses and provides 24/7 support to biological and adoptive families who open their homes and heart with stability and safety for medically fragile children, their siblings and families."}, {"name": "Adelante Development Center", "description": "Back in Use is a unique program that connects low-income seniors to durable medical equipment including wheelchairs, walkers, and shower benches, and other items that they need to improve quality of life, increase independence, and reduce risk of falling.  This equipment, which is costly yet often not covered by insurance, is provided free of cost."}, {"name": "Barrett Foundation, Inc.", "description": "Homelessness impacts health, education, employment and community stability. The ABQ Point in Time Count, January 2017, found 1318 people experiencing homelessness (30% female), an increase of 3% since 2015. Of those, 28% reported being chronically homeless, up 68% since 2015. The lack of affordable housing, stagnant economic growth and low wages continues to exacerbate the problem. ABQ’s shortage of affordable housing and program funding has caused a backlog in housing options."}, {"name": "Read Write Adult Literacy", "description": "The Read \"Write\" Adult Literacy Program offers free individualized tutoring for adults in Basic Literacy, English as a Second Language, US Citizenship,  and Computer Literacy to individuals in Torrance County and the surrounding communities. We have provided services for individuals from 13 different countries./n/nRead Write provides one-on-one tutoring in Basic Literacy (6th grade and below), Pre-GED (7th & 8th grade levels), English as a Second Language, and US Citizenship. We are the only literacy program in Torrance County and all our services are free."}, {"name": "New Mexico Kids Matter Inc.", "description": ""}, {"name": "Roadrunner Food Bank Inc", "description": "According to Feeding America’s 2017 Map the Meal Gap assessment, New Mexico ranks second highest among the states for food insecurity in children. Given this grim statistic, Roadrunner Food Bank considers our food distribution at schools a moral imperative. To address this need, we launched the Childhood Hunger Initiative (CHI) in the 2014-15 school year. Through this program, we provide food, including fresh fruits and vegetables, directly to children and their families at 85 elementary, middle and high schools throughout our 16 county direct service area, including 48 schools in central New Mexico. Over the past three years, CHI allowed us to increase the amount of food we deliver to schools from approximately 400,000 pounds per year to 2 million pounds with little to no cost increase."}, {"name": "Children's Grief Center of NM", "description": "CGC's bereavement peer support groups offer an age appropriate venue for young people and their caregivers to share feelings and experiences with those in similar situations. Feeling alone, confused and angry are common emotions after the death of a loved one. Groups work to mitigate the risk that painful feelings transform into lifelong struggles."}, {"name": "CLNKids", "description": "CLNKids’ preschool program is targeted to young children experiencing homelessness ages 3 to 5. The Center on Family Homelessness ranked New Mexico 44th among all states in child homelessness in 2014. Albuquerque Public Schools Title I project estimates 800–1,000 children under the age of six were homeless in the Albuquerque metro area in 2016. The primary factors contributing to family homelessness are poverty, lack of affordable housing, and domestic violence. CLNKids’ parents are single-mothers under 30 years old, who lack high school diplomas or GEDs, and are predominantly minorities (Hispanic and Native American). Many are fleeing domestic violence. They are forced to raise their children in vulnerable, at-risk environments, including homeless shelters, cheap motels, and the street. Some even live in their cars with their children. Many of CLNKids’ children are socially and developmentally disadvantaged. Homeless children experience three times the rate of emotional and behavioral problems compared to non-homeless children; are four times more likely to show delayed development; and have twice the rate of learning disabilities as non-homeless children. They also experience high rates of chronic and acute health problems while homeless. Through parent reporting CLNKids has learned that 75% of children in our program have observed and/or experienced family violence. CLNKids preschool uses a high quality, trauma-informed, strengths-based curriculum to meet the special needs of the vulnerable children in our program. We provide developmentally appropriate instruction in Kindergarten readiness skills that include literacy to bridge language gaps, STEM, and handwriting. Our Reggio Emilia approach-inspired curriculum and environment engages children based on their interests through extended provocations and hands-on exploration. Students, teachers and parents travel to Explora monthly to engage in a multitude of STEM hands-on activities. We partner with the Nature Center to hold two, eight-week sessions that immerse children in the natural world. We also conduct regular field trips to local sites (Bio Park, Zoo, Botanical Gardens, etc.). Essential is providing health and wellness activities and ongoing development screenings (physical, dental, socio-emotional, language and intellectual delays) that ensure readiness for success in Kindergarten. Children have access to mental health and therapeutic services, art therapy and play therapy to address socio-emotional needs, a wellness coordinator, and the KidFit program, in which instructors work one-on-one with children around physical fitness activities emphasizing strength, coordination and endurance. The physical activities we plan for children are designed to enhance and support our trauma-informed curriculum. Our wellness coordinator builds on the KidFit physical activities and incorporates these activities into the teachers’ lesson plans so that appropriate, daily exercise activities are included. Children play in a developmentally appropriate outdoor playground that is fully enclosed. Healthy nutrition is an important part of our preschool program. Children are served a hot breakfast, hot lunch, and a snack every day they attend school, and are sent home on weekends with a backpack filled with food. CLNKids strives to place our most educated teachers in the preschool classroom. Given that many children come to our program significantly behind academically, having highly educated and trained teachers offers these children the best chance for success in Kindergarten. Our preschool has a low student-teacher ratio at 1:8 that allows for individual attention to help children catch up quickly. CLNKids staff are trained in adverse childhood experiences and to recognize behaviors associated with trauma, which enables them to fully support each child. We provide a daily bus service to our program that operates year-round, Monday to Friday, 7:00am–5:30pm. No fees are charged to parents."}, {"name": "NMCAN (New Mexico Child Advocacy Network)", "description": "Central New Mexico is home to more than 8,000 youth ages 17-24 who are disconnected from education and the workforce, a circumstance that has enormous impact on their lives and our community. The vast majority of these kids have histories of homelessness, foster care involvement, poverty, parental abuse and neglect. Contending with substantial adversity and little support, these kids are at high risk for criminality, substance abuse, and suicide. Back on Track will connect these youth to the workforce and provide the extensive support needed to keep them on track to graduation, college, and career. By improving the outcomes of these vulnerable kids, this project will help improve our entire community."}, {"name": "La Plaza Encuentro", "description": "Encuentro is partnering with CNM to increase employment opportunities for low-income Spanish speaking immigrants who struggle with chronic under-employment resulting from low English language literacy and limited formal education. This project will increase the employability and financial stability of this primarily female group through participation in Encuentro’s linguistically appropriate Home Health Aid certification course and related English instruction. The project includes wrap-around services to students:  access to an onsite social worker, childcare during classes, and student scholarships to cover enrollment, textbook and lab costs."}, {"name": "APS Education Foundation", "description": "Missing just two days of school a month puts a child at risk for falling behind and, if that happens in elementary school, it is more likely to become a habit. Across Albuquerque, APS Attendance teams at elementary schools that struggle with high rates of truancy will work with families and existing community resource partners to identify the most vulnerable and disadvantaged children to get them back on track to educational success  by solving the underlying problems that impact attendance such as poverty, hunger, homelessness, and family trauma. "}, {"name": "Central New Mexico Community College Foundation", "description": "More than half of the achievement gap between lower- and higher-income youth can be explained by unequal access to summer learning opportunities. Through this project, CNM will offer dual-credit summer boot camps focused on reading, math, and college-readiness skills to students in low-income, Title 1 high schools, to better prepare them to meet high school graduation requirements and be successful in college."}, {"name": "New Mexico Autism Society", "description": "As many as 1 in 45 children have been identified with autism spectrum disorder, and incident rates are on the rise.  Explora and the New Mexico Autism Society are teaming up to provide STEM-rich learning experiences to prevent summer learning loss and minimize the achievement gap that results from unequal access to summer learning for autistic children for whom learning loss can be extreme. This project will also serve as a case study through which UWCNM and agency partners learn how engagement organizations such as museums and parks can work with agencies that support special populations to design programs to benefit children and families."}, {"name": "Centro Savila", "description": "Untreated behavioral health issues are associated with negative outcomes like interaction with law enforcement, the criminal justice system, poverty, homelessness, and self-harm. Children are far more likely to access the behavioral health services they need if those services are provided in schools. Working in partnership with schools, Centro Savila will provide prevention and early intervention services for students and families in an attempt to reduce the elevated rates of suicide, drug overdose, alcohol related deaths, and substance abuse among youth in our community, at a time in life when the negative outcomes of untreated behavioral health issues have the best chance of being avoided."}, {"name": "New Mexico Community Aids Partnership", "description": "Transgender and gender non-conforming youth demonstrate significantly higher rates of depression and suicide than their peers, so this project aims to improve their behavioral health and well-being by offering services to the youth and their families, along with training and consultation to youth serving organizations, including schools, teachers, and healthcare professionals. The goal is to make programs and facilities safe and supportive and to provide appropriate referrals if additional care or services are needed. This project has the potential for community-level change as institutions in our community learn best practices for serving this vulnerable and underserved population. This project will also serve as a case study through which UWCNM and agency partners learn how grassroots organizations serving the extremely underserved can begin to effectively measure their social impact."}, {"name": "New Mexico Immigrant Law Center", "description": "Founded in 2010, the New Mexico Immigrant Law Center is the only legal service organization in New Mexico dedicated to advancing the rights and opportunities of low-income immigrants facing separation from their families.  Access to to legal services provided by NMILC enables immigrants to obtain legal status that can lead to better jobs, access to credit and bank accounts, reunification with family members, access to healthcare, increased educational opportunities for children and adults, and full participation in the civic life of our neighborhoods and communities./n/nThis program is designed to increase self-sufficiency and financial stability for low-income immigrant victims of abuse, including children and survivors of domestic violence, sexual assault or trafficking, by providing free legal services. Our services result in clients’ access to work authorization and freedom from abusive living situations."}, {"name": "Rape Crisis Center of Central New Mexico", "description": "The Rape Crisis Center of Central New Mexico's Crisis Services/Advocacy Program provides free 24/7 support/advocacy to survivors of sexual assault/abuse and their loved ones throughout Central New Mexico, responding to 2200+ hotline calls & accompanying approximately 450 victims during SANE exams per year."}, {"name": "New Mexico Foundation for Dental Health", "description": "Donated Dental Services (DDS) is a program through which low income elderly and disabled clients receive free, extensive dental treatment in the offices of New Mexico's dentists. The objective of DDS, the only program offering extensive dental care at no cost in the state, is to increase access to dental care for these underserved New Mexicans."}, {"name": "S.A.F.E. House", "description": "S.A.F.E. House (SH) is a social service agency serving the Greater Bernalillo County area. For over 42 years, SH has provided a safe and supportive shelter environment to victims of Intimate Partner Domestic Violence (IPDV). SH provides a continuum of services including intervention, community education and victim advocacy. Our residents are provided a clean, safe and secure refuge where families can begin to learn to live a life free of IPDV. Our residents and their children receive nutritionally approved meals, clothing, shoes and other basic needs, such as toiletries, and laundry supplies. SH also offers a 24-hour crisis hotline; case management that includes transportation, support to address education and employment, legal advocacy, transitional housing, support groups, and the dynamics of IPDV education classes."}, {"name": "Cornucopia", "description": "For nearly four decades, Cornucopia Adult and Family Services has been the only community-based inclusion agency serving the most vulnerable adults (including the elderly, frail, and/or disabled) in Albuquerque’s South Valley, a minority-majority and low-income community, and a medically underserved area./n/nCornucopia serves low-income adults with disabilities and seniors. Our mission is to offer a safe, growth-oriented environment where clients can maximize their potential. We help clients and their families in Albuquerque’s underserved South Valley area overcome barriers to social inclusion, prolong independence, and prevent institutionalization."}, {"name": "New Mexico Jazz Workshop", "description": ""}, {"name": "Children's Choice Child Care Services", "description": "Need/n/nThink back to the best parts of elementary school. Was it was creating projects for a science fair? Or was it writing your own book to share with your parents? Maybe it was a service learning or volunteer project?  Elementary school should be a time that for students to explore their interests, but for so many students this is not possible. The school day is occupied with rigorous testing requirements, and budget and time constraints limit field trips and other enriching activities. Still- New Mexico ranks 49th in the nation for education and 50th for childhood well-being (per the Annie. E. Casey Foundation).  Students are bored, they become disengaged and school becomes a chore./n/nIf all of the things we recall so fondly from elementary school are being pushed out of the traditional school day, it’s easy to say “Students should do art classes after school.” But after-school programming is often out of reach for New Mexican families. Indeed, over 75000 families in New Mexico are in need of care that cannot access it, either because programs are operating at capacity or because the tuition is too high for many families. This leads to parents having to make difficult choices: do they leave work early? Do they allow their children to stay home alone?/n/nMethodology/Population Served/n/nThe answer to this cluster of problems (student disengagement, lack of access to after school care, poor student academic performance) is found in Children’s Choice's Find Your Spark enrichment classes. These classes are free to students, take place on school grounds afterschool, and last for the entire school year. Here’s how it works: Children’s Choice leadership team surveys all enrolled students, parents, and teachers at each of our 13 school sites, including 6 Title 1 schools  (at least 50% of enrolled students qualify for free/reduced lunch) and 3 moderate income schools (between 40-50% of enrolled students qualify for free/reduced lunch) to determine what classes and subjects are most needed.  We then meet with school administration to identify the students who are most in need of additional services (Need could be determined by a family’s financial situation, children who are chronically truant, etc) and enroll them first. Then registration opens to all families. The kinds of classes offered include: STEM, the arts, service learning, health and fitness, and cognitive skills. These are classes that are meant to help students try out different and exciting subjects to find the thing that makes them excited to learn and excited to go to school. The need for this program is great- we currently offer 119 classes with low student to teacher ratio./n/nImpact/n/nThe impact of this program is far reaching. Specific measures of success are listed elsewhere but Find Your Spark classes give over 1500 students access to free, high quality afterschool care while improving their engagement and performance in school. This gives parents the peace of mind knowing that their students are safe and engaged during the afterschool hours. This program means that enriching activities are not solely accessible to families that have the means to pay for them. Find Your Spark democratizes opportunity for our students./n/nFunding from the United Way will go exclusively to support Find Your Spark classes at Title 1 schools./n/nWhy Us/n/nChildren’s Choice is uniquely qualified to administer the Find Your Spark program. Ranked as one of the top workplaces and the only 5-star rated after-school provider in Albuquerque (for our Core Program- more traditional tuition-based afterschool care), we have the experience and expertise to make these classes a success. While the Find Your Spark classes are plentiful, quantity must be matched by quality.  Thus, classes are taught by professionals in their field and classroom teachers. Classes are always play -based and experiential with low teacher to student ratios."}, {"name": "Explora Science Center & Children's Museum of Albuquerque ", "description": "As a critical component of Explora’s STEM Education and Workforce Development initiative, the Youth Intern Program is a highly successful endeavor that provides 30 paid internships a year for low-income, high-achieving, culturally-diverse teens in Albuquerque. The program supports the interns as they develop workforce skills, receive college and career mentoring, explore the principles of experiential learning, provide community service, and serve as near-peer mentors for up to 5,000 elementary school children annually via Explora’s STEM educational programs. Interns spend their sophomore year training on basic job skills and experiential learning, junior year in intense program-facilitation training, and senior year providing educational programs at Explora and in the community. Additionally, each intern is paired with a mentor who supports their job performance and helps them explore potential careers. Mentors also provide support for the students’ high school academic programs and assist in selecting and applying to colleges./n/nAlthough New Mexico boasts a rich multicultural heritage and a variety of high-technology employment opportunities, the state is plagued by some of the highest rates of poverty, school drop-outs, teen pregnancy, and substance abuse in the nation. The Youth Intern Program helps break the cycle by targeting students at two critical levels — high school and elementary school — to build interest, confidence, value, and understanding of STEM fields via experiential education programs. It contributes to the development of a stronger workforce by cultivating critical job skills for the interns, including effective communication, time management, résumé writing, and team collaboration, as well as teaching them how to balance school and work to succeed in both. Many of the interns will be the first in their families to pursue higher education and will need to work during college to support their families as they work to build their futures; the Youth Intern Program prepares them to do so./n/nThe target population for Explora’s Youth Intern Program is low-income high school sophomores, juniors, and seniors who desire opportunities for practical workforce training and meaningful community engagement. In New Mexico First’s 2016 report, “Economic Security and Vitality in New Mexico,” our state’s changing workforce was described as follows: “By 2020, most New Mexican students will not have the education, credentials, or degrees required to fill 63% of New Mexico’s jobs.” Town hall participants described solutions, including efforts to increase the number of graduates with STEM degrees.  Explora’s Youth Intern Program is developing these future graduates, with the added benefits of enabling the teens’ contributions to one of the most active and beloved learning centers in New Mexico./n/nExplora takes a strong assets-based view of our interns. These are not teens who need fixing, but young adults who have valuable knowledge and experience to offer; they simply need a supportive venue in which to contribute. By focusing on young community members, Explora’s Youth Intern Program lays a strong foundation for future economic growth in our state. The substantial educational work of the interns compounds exponentially, because their pupils are elementary and middle school students who look up to the teens as near-peer mentors. Ideally, as the interns graduate from the program and move onto higher education and professional careers, the students they served will continue the tradition of communal learning."}, {"name": "Family Promise of Albuquerque", "description": "Family Promise of Albuquerque (FPA) serves families who are struggling with homelessness in the Albuquerque area. 100% of the families we serve are at or below the Health and Human Services Federal Poverty Guidelines. According to The National Center on Family Homelessness, New Mexico ranks 44 out of 50 for the risk of child homelessness and extent of child homelessness. FPA helps with basic needs of these children and their families.  Albuquerque Public Schools most recent statistics show 3,689 school aged children were homeless.  However, children under the age of five make up about 45% of the population of children in families who are homeless. So, on any given night the Albuquerque area has 6,700 homeless children.  These children are some of the most vulnerable of the population living in poverty and in unstable living conditions.  Family Promise allows families, however they define themselves, to stay together in a safe-shelter setting.  "}, {"name": "All Faiths", "description": "As the industry leader in child/family behavioral health services, specializing in the prevention and treatment of child abuse and trauma, All Faiths’ mission is to serve as the premier trauma healing center by empowering generations of New Mexicans to create pathways to prevent and transcend the effects of trauma and abuse."}, {"name": "Family Independence Initiative (FII)", "description": "In the 53 years since President Johnson declared a war on poverty, the poverty rate in America has not significantly improved. Nearly 50 million people live in poverty with many more only slightly above it. Entrenched in the traditional service approaches are stereotypes that poor people can’t manage money, take little initiative, and aren’t willing to help one another. Programs and policies directed at low-income people are generally needs based, which disincentivizes initiative and mutual assistance adding to the stereotype. The war on poverty has made poverty tolerable but has not been a springboard to lasting self-sufficiency. This reality has never been truer in New Mexico that has recently slipped to 49th of all states in economic well-being of its families and 51st in child poverty."}, {"name": "Storehouse West", "description": "Storehouse West's Fill the Plates in Sandoval County program serves all residents of the County whose income, based on federal guidelines, is insufficient in meeting household needs.  Roughly 54% of our clients comprise senior residents including seniors with children in the household (16% of all children).  The remaining clients are comprised of roughly 45% families with children including female head-of-household (7%) and couples and single person households.  Roughly 15% of all clients reside on pueblos within the County.  Clients are provided service once each month by visiting the building or through deliveries (one-third of all clients) made to pueblos or senior residences and facilities.  In the past four years the number of persons served by the Program have increased by over 9% demonstrating a continuing and increasing need for the services provided.  Persons accessing service have consistently responded positively  to questions concerning the impact of the Program on their performance in work and school situations."}, {"name": "Galloping Grace Youth Ranch", "description": "Galloping Grace Youth Ranch (GGYR) is a working, sustainable farm/ranch offering a Junior Leader Program. Youth, ages 12-18, participate in our youth-led program which focuses on agricultural education and leadership development. The 4-H component of the program complements by teaching responsibility, empathy, family involvement, and problem solving.  In an agricultural setting, we promote positive outcomes for young people by providing opportunities, fostering positive relationships and furnishing the support needed to build on their leadership strengths.  Our program proactively mitigates at risk behavior by establishing a connection between youth and experiential learning opportunities that foster and enhance their developmental, emotional, mental, physical, and social skills.   /n/nGalloping Grace Youth Ranch Junior Leader Program serves youth and families in Sandoval and Bernalillo Counties. The program targets youth at a critical time for teens; when they're learning how to become confident, effective, and positive leaders in society. In 2017, we had 42 Junior Leaders participate in the program. Daily, Junior Leaders learn and teach others, through interactive, innovative, and hands-on learning (raising livestock, gardening, insects, worms, aquaponics, science and soil). The Junior Leader Program challenges them to participate in our \"outdoor classroom\" which focuses on agricultural education, and leadership development to include social and emotional skills. At the ranch, they have the hands-on opportunity to learn and teach others about livestock - goats, pigs, cattle, and chickens. Our livestock are educators and through them, Junior Leaders gain insight and knowledge about food production, food waste/recovery, and food insecurities./n/nJunior Leaders learn about the environmental impacts of diverting food waste, participate in food production (raising and feeding livestock) and experience the impact of charitable giving of food donations to local agencies. Locally, Galloping Grace Youth Ranch is leading the movement to manage food waste with best management practices to reduce food waste, feed the hungry, feed livestock and to create rich soil through the composting process. These practices have been raised to a national priority by the US Department of Agriculture (USDA) and the US Environmental Protection Agency (EPA). Working with community partners, we recover good food that is still consumable for animals and feed it to our livestock. The food that is not consumed is composted and becomes part of GGYR's soil for crop cultivation. In 2017, GGYR diverted close to 2,000,000 pounds of food from the landfill which was used to feed our livestock and educate our children./n/nA newly added component to our Junior Leader Program is the establishment of the GGYR 4-H Club. 4-H (Head, Heart, Health, and Hands) is a global network of youth organizations whose mission is \"engaging youth to reach their fullest potential while advancing the field of youth development.\" We feel that the 4-H mission is integral to our Junior Leader Program, as it builds and adds to acquired agricultural education and leadership skills by reinforcing responsibility, project planning, family involvement, and problem solving. Junior Leaders are challenged with real-life issues as they learn responsibility through raising and showing their livestock. They will seek sponsorships for their animal by working and learning with others, relying on initiative, self-motivation, and internal drive to meet those goals. They will be responsible for working with their animal and tracking their progress in preparation for showing and judging at the Sandoval County Fair. With our 42 Junior Leaders, we doubled the size of the 2017 Sandoval County Fair in Cuba, NM. For 37 of the Junior Leaders, it was their first time attending! Our Junior Leader Program cultivates healthy kids today, so they can harvest a healthy society tomorrow."}, {"name": "Golden Apple Foundation of New Mexico", "description": "The Population:  The Golden Apple Early Career Teacher Institute (ECTI) seeks to serve teachers in their first three years.  Offering skills based support to this group of professionals is critical to their continuation in the profession and the optimization of their professional improvement during the early years of their careers.  The ECTI will extend professional development support after teachers have exited the Albuquerque Public Schools (APS) Mentor Program with content informed by exit data indicating areas of continued need./n/nIn 2016, APS reported 372 participants exiting their first-year Mentor Program.  Assuming a conservative attrition rate of 35 percent of those participants in a five-year span from when they began teaching, by 2021 the district will have to replace 130 of those positions.  Given the average classroom size of 27 students, that works out to at least 3,510 APS students being impacted by teacher attrition. /n/nWhy is the Work Important?  In their 2013 study “How Teacher Turnover Harms Student Achievement”, researchers Ronfeldt, Loeb and Wycoff found that “teacher turnover has a significant and negative impact on student achievement in both math and English language arts. Moreover, teacher turnover is particularly harmful to the achievement of students in schools with large populations of low-performing and (minority) students.”/n/nRoughly two thirds of the 85,000 students in APS qualify for the federal free-and reduced price school lunch program, and 71 APS elementary schools are identified as “high poverty” and qualify for federal Title I funding.  If teachers receive extended support in their early careers, they are more likely to stay and continue to improve their practice.  Research indicates that teachers receiving extended support leave at half the rate of teachers that do not receive such support.  The ECTI can extend the support provided by the APS Mentor Program and help reduce early career-attrition./n/nHow will we provide services?  Golden Apple will present its ECTI as a set of six two-hour collaborative professional development sessions facilitated by recipients of the Golden Apple Award for Excellence in Teaching and National Board Certified Teachers.  Participants will be invited from the cohort of teachers being served by the APS Mentor Program. /n/nThe professional development sessions will be designed based on recent (2016) data collected by the APS Mentor Program.  In exit surveys of 372 participants, the data clearly describes a continued need for professional development in the following areas:  Assessment and evaluation of students, handling difficult behavior, asking effective questions of students, making standards work, employing interdisciplinary approaches to instruction, and involving parents effectively. /n/nImpact:  By building the ECTI curriculum to respond directly to the experiences of the early career teachers surveyed by the APS Mentor Program, the ECTI will offer a meaningful extension of the Mentor’ Program’s critical efforts.  We will invest in teacher quality by supporting early career teachers that still need professional development in addition to what the district can provide.  This investment will help retain teachers, who will build experience and get more effective in their practice.  According to the Center for Analysis of Longitudinal Data in Education Research (CALDER):  “Early-career experience has a clear payoff in teacher effectiveness, and the impact is stronger than the effect of most other observable teacher-related variables including advanced degrees, teacher licensure tests scores, National Board certification at the elementary level, and class size.”/n/nIf the ECTI can improve the practice of its participants, and prevent the attrition of ten teachers that might otherwise leave, the negative impacts of teacher turnover will be avoided for as many as 1,350 APS students over the next five years."}, {"name": "Southwest Creations Collaborative", "description": ""}, {"name": "La Vida Felicidad", "description": ""}, {"name": "New Day", "description": "APS estimates thousands of youth in its system are homeless. NM has 200-300 youth in foster care who are in the process of “aging out” of the system. The 2017 Kids Count Report estimates 10% of youth in NM are “disconnected,” neither in school nor employed.  These youth often end up living in shelters, on the street or involved in child welfare or juvenile justice. They have been abused or neglected and have experienced wide-ranging and prolonged trauma.  There is strong evidence that such trauma, as measured by the Adverse Childhood Experiences scale (ACES), is strongly associated with adult health and psychological problems.  An ACEs score of 4 or more is associated with a seven-fold increase in alcoholism; a score above 6 is associated with a 30-fold increase in suicide.  The average ACES score in the general population is 1-2.  The average ACES score of young people coming to New Day is 6.  This population of youth can easily get “trapped” in a vicious cycle of continued traumatization, survival-based behavior and poverty that becomes increasingly difficult to escape.  Because they lack the necessary life skills, emotional intelligence or community connections, it becomes increasingly difficult to get and keep jobs, further their education, and build realistic hope about a future.  Without the right help this cycle frequently leads to social isolation, involvement with gangs or drugs, criminal behavior, sexual trafficking victimization, etc.  The way out of this cycle requires an understanding of these realities and a structure that builds meaningful relationships and creates progressive opportunities for movement and success.  This is how New Day’s Life Skills Academy (LSA) is designed.    The LSA serves youth ages 14–22 in the Albuquerque area who are homeless, disconnected and/or marginalized.  It offers a continuum of opportunities for young people to learn, connect and become part of a positive community. The continuum includes:/n/n• Easy access classes designed to invite young people to start on their pathway.  The classes cover: Health is Wealth, Education for Life, Identity and Culture, Healthy Relationships and Communication, Leadership  and Advocacy, Employment and Careers, Emotional Intelligence/n/n• Longer, intensive, enriched  life skills courses covering employment, healthy relationships,  emotional intelligence, financial literacy, leadership/n/n•   One-on-one life skills coaching for youth needing specialized attention, with a focus on education and employment/n/n•   “First Job” experience operating the New Day food cart, where youth learn business planning, menu development, food preparation, sales, financial accounting, etc./n/n•    A youth leadership group where youth can practice newly learned skills, try out facilitation and advocacy skills, practice public speaking, lead classes and activities, etc./n/nBy participating in the LSA youth begin the journey of living their life in a way defined by something other than trauma and homelessness.  Specifically they build 1. Functional intelligence: practical knowledge necessary to function independently in our society, which includes daily living skills such as financial literacy, cooking, grocery shopping, health, job readiness, etc.; 2. Emotional intelligence: internal and interpersonal skills necessary to manage in a complex world, which includes impulse control, anger management, delayed gratification, conflict resolution, and decision making; and 3. Social capital: the necessary community connections and positive adult allies who will help youth build a bridge from adolescence into a positive, meaningful and contributing adulthood. /n/nThe LSA has 12 to 15 diverse class offerings each month (most taught by outside community members) along with transportation, a website for registration, social activities to give a sense of belonging, \"field trips\" to different parts of the community, and state-of-the-art facilities, including a computer lab."}, {"name": "Meals on Wheels", "description": "The Low Income Food & Enrichment (LIFE) program provides home delivered meals in the Albuquerque area at no-cost or subsidized to those who meet the Federal Poverty Level, are homebound, and require a special diet due to health issues. Currently, we serve 175 people (the equivalent of 42,352 meals) a year who are suffering or recovering from illness, or otherwise unable to leave the home. Our clients are living with health issues such as diabetes, coronary disease, renal failure, chewing or swallowing problems, orthodontia issues, disabilities, brain or spinal cord injuries, and end of life transitions. Half of our clients are adults between the ages of 25-64 and the other half are seniors 65+ living on an average of $771 a  month."}, {"name": "Big Brothers Big Sisters of CNM", "description": "mentor2.0 is a technology-enriched one-to-one mentoring program implemented in two Albuquerque high schools—South Valley Academy (SVA) and Amy Biehl High School (ABHS). SVA has a 99% Hispanic student population, with a large majority coming from Spanish-speaking homes; 93% of students are low-income and 90% first generation college-bound. ABHS has a 65% minority student population (44% Hispanic) and 29% first generation college-bound. ABHS enrolls many students not succeeding in traditional schools or struggling to overcome other adverse situations./n/nNew Mexico repeatedly falls at or near the bottom in educational outcomes compared to other states. The 2017 Kids Count reported that in Albuquerque Public Schools (APS) 73% of 8th graders are NOT proficient in reading and 81% are NOT proficient in math, indicating that they lack the required skills to do well in high school and college math courses. At APS, 14% of students are habitually truant, and only 66% of students graduate in 4 years, less than the state average of 71%. mentor2.0 equips at-risk high school students with the skills, knowledge, attitude and motivation to do well academically, graduate and pursue postsecondary education and career success./n/nmentor2.0 is embedded in high schools as a college curriculum course provided to students via weekly classes for the entirety of their high school years. The curriculum focuses on personal development, college-readiness, and 21st century workforce skills; fits the developmental needs of students at each grade level; and exposes students to various career opportunities. Mentees participate in mentor2.0 as a requisite part of their high school curriculum. BBBS-CNM recruits established professionals as volunteer mentors to work in conjunction with schools to inspire and guide mentees to thrive in school, graduate, and attend college. Mentors are encouraged to remain with their mentees throughout high school to graduation. Mentor-mentee matches are required to communicate at least weekly through email using the mentor2.0 technology platform, which helps mentees develop writing and communication skills and build confidence and ability to self-express. Every 4-6 weeks the matches gather in a group setting at the school to engage in deep sharing and enrichment activities. Matches continue throughout high school, supported by professional BBBS program specialists who provide weekly classroom instruction, guidance, event coordination, and match support. They offer assistance with questions or concerns, including challenges that might put a match at risk for early closure. Our commitment to match support ensures child safety and the highest outcome for the child. In fall 2017, most students in grades 9–12 at SVA and ABHS were enrolled in mentor2.0 and matched one-to-one with mentors (564 students). In fall 2018, BBBS-CNM will continue to match an estimated 599 students in grades 9–12 at both schools with mentors./n/nmentor2.0 program evaluation results show youth mentees are making positive improvement to change their perspectives and lives. A primary focus of mentor2.0 is on students developing and maintaining an interest in higher education and improving academic outcomes. In 2016-17 mentor2.0 teens reported the following positive outcomes from their one-to-one mentoring experience: 98% advanced to the next grade; 91% of students expect to go to college; 89% of 12th grade students applied to college and 98% were accepted to at least one school; 56% improved or maintained their overall grades; 49% feel more accepted by their peers; and 24% are less likely to participate in risky behaviors. As is evident from these results, mentor2.0 equips at-risk high school students with the skills, knowledge, attitude and motivation to graduate and pursue postsecondary education and career success, which prepares them to become future community leaders. Within a few years, BBBS-CNM plans to scale mentor2.0 to additional schools."}, {"name": "Native American Community Academy Foundation", "description": ""}, {"name": "Advocacy Inc.", "description": "Vulnerable Population:/n/nThe Project benefits at risk minor and developmentally disabled children and adults and their vulnerable, low income caregivers./n/n• 81% are in the Greater Albuquerque Area;/n/n• 94% earn below 200% of the poverty level…and it is important to recognize that 60% of all grandparent caregivers are more likely to live in poverty than their non-caregiver grandparent counterparts;/n/n• Many of our clients speak no English, and we employ, contract and maintain fluent Spanish speaking staff, attorneys and social workers to assist with this growing population;/n/n• 39% of our client are Hispanic, 14% are Native American, 10% are Black, and 4% identifying as multiracial;/n/n• 81% of our caregivers are female; and,/n/n• 26% of the children that require caregivers in our cases are under the age of 10./n/nCommunity Need:/n/nThe 2010 Census reports that no less than 79,392 children in New Mexico are living with grandparents or non-parent caregivers. The NM Guardianship Project assists caregivers in formalizing these relationships for New Mexico’s children to become healthy and educated members of the community. More than 95% of our clients earn less than $48,000 with most below 200% of the poverty level. In 2017, Advocacy served 31,974 persons with information, brief legal service, full legal service, and referrals which confirms the need and demand for our services./n/nFamily Guardianship for developmentally disabled adult children is necessary for low income families, who are disproportionately represented in our community. Although the Americans with Disabilities Act assures equal opportunities in education and employment for people with disabilities and prohibits discrimination on the basis of disability, people with disabilities remain overrepresented among America’s poor and undereducated.  According to the US Census Bureau, New Mexico is ranked 50th in the country for Poverty rate by household income./n/n Method of Service:/n/nThe NM Guardianship Project maintains a director, attorneys, support staff, interns and volunteers. Once a referral is received, staff completes a comprehensive intake with the guardian receiving information on access to available benefits. Powers of Attorney and Caregiver Affidavits are provided. Staff prepares documentation to petition the court for accepted cases. A social worker visits and assesses the home—a service component that is not required and which is not typically available. Adoption requires additional counseling which we provide. The home assessment promotes stabilization of the new family unit by increasing access to mental health, medical, financial and educational services connecting the guardian with needed support. The home assessment also serves as an unbiased, independent source of information for the court. Legal guardianship provides the legal tools necessary for the newly formed family to meet the needs of the child and can have a huge impact on a family's or child's future success./n/nCommunity Impact:/n/nGuardianship and adoption provide safety and security. The underlying substance abuse or mental health issues of a parent who is unable or unwilling to care for the child often places the child in precarious and traumatic situations. Caregivers cannot prevent a parent from removing the child from their home unless a guardianship or adoption is in place. With the guardianship or adoption, the child is better able to form a healthy relationship with the caregiver and the caregiver can stop the parent from removing or endangering the child. These children live in safety and security—shielded from abuse and unstable living conditions that can lead to unhealthy behaviors. The Population Reference Bureau reported in 2005, that grandparents alone “informally care for about twelve times as many children as our nation's foster care system,” offering a stable environment that allows the child’s healthy development and independence later in life."}, {"name": "OASIS-Albuquerque", "description": ""}, {"name": "Assistance League® of Albuquerque", "description": "Operation School Bell® provides new clothing for the most vulnerable children in 35 of the Title I elementary and middle schools in Albuquerque Public Schools, enabling them to attend in accordance with school uniform policies. The program supplies vouchers to students so families can shop for new school clothing and shoes in local stores."}, {"name": "NMCAN (New Mexico Child Advocacy Network)", "description": "NMCAN  partners with young people to build community and lead change. We authentically engage young people impacted by the foster care and/or juvenile justice systems to improve their transition to adulthood. Together, we work to:/n/nOpportunity Passport assists young people in pursuing a path to economic success. It includes financial education and support to establish, maintain, and grow a bank account through a 1:1 match. They become financially capable and acquire assets in transportation, housing, and other areas that contribute to financial viability and well-being."}, {"name": "Albuquerque Sign Language Academy", "description": "The Albuquerque Sign Language Academy (ASLA) requests funding to support and expand the ongoing partnership between the Albuquerque Sign Language Academy, the Rocky Mountain Youth Corp (RMYC), and the US Forrest Service (USFC) by creating a summer program that aligns with and will ultimately feed the RMYC.  When the ASLA first partnered with RMYC to establish the first Deaf/Hearing work crew in New Mexico, the criteria for participation was already established. That is, many of the ASLA students were unable to be involved in the program due to age restrictions, physical or cognitive disability, or citizenship status. RMYC was VERY willing to be big-thinking about how to accommodate these students, however the restrictions were imposed by secondary partners to the project - namely Americorp and the US Government (re: immigration). Consequentially, many ASLA students who had other disabilities (in addition to being deaf) or immigration issues just didn't \"fit\" the original participant profile. RMYC was able to accept many of those students as \"volunteers\", however they were not eligible for any compensation or scholarship. The goal of the ASLA Outdoor Conservation Crew is to develop a summer conservation service program that would allow ASLA middle school students, students with disabilities, and students whose immigration status is in question to spend a summer learning and participating in environmental service projects throughout the community.   This programmatic expansion would align with the existing RMYC system and serve as a \"feeder\" program to an already nationally established Youth Conservation Corp model.  Long term, more ASLA students would be introduced and have access to the RMYC summer program which lends to more long-term opportunity for a community that historically has had limited career options.  It is relevant to note that the unemployment and underemployment rate of deaf adults and adults with disabilities hovers around 70%.  The ASLA is dedicated to establishing and growing programs to address this sobering statistic.  The ASLA whole-heartedly believes that the ASLA Summer Conservation Crew and the it partnership with RMYC and USFS is a long-term strategy that would address this imminent (deaf) community need."}, {"name": "New Mexico Legal Aid", "description": "Partnering for Native Health works to improve the health of low-income Native Americans by expanding the services available at First Nations Community Healthsource (FNCH) to include civil legal aid addressing social determinants of health. Collaborating partners are New Mexico Legal Aid (NMLA), the state’s largest provider of civil legal services, and FNCH, Albuquerque’s urban Indian health center providing culturally competent comprehensive health care./n/nThe project service area has approximately 40,500 individuals who are Alaskan Indian/Native American, about 6.1% of the overall population. FNCH is this population’s primary care provider. Native Americans have significant vulnerabilities that affect their health: a higher percentage live below the federal poverty level (25.4%) compared to the general population (15.2%). More Native Americans are unemployed, die of diabetes, and die of unintentional injury. There are more Native American children under age 6 living below the poverty level, and children in poverty have lower academic achievement, higher drop-out rates, more accidents, more injuries, and more food insecurity. Social determinants of health – like the environment where we live and what our incomes are – account for as much as 80-90% of a person’s wellbeing. Said another way, “your zip code is a better predictor of your health than your genetic code.”/n/nA medical-legal partnership aims to transform clinic practice by treating both medical and social issues affecting patients’ well-being. Attorneys train medical staff how to identify patients’ legal needs that are adversely affecting their health. Doctors then make referrals to the legal aid attorney on site as they would make a referral for physical therapy or other special service. The attorney then treats those needs through a variety of legal interventions and reports the outcomes back for the patient’s record. The mnemonic I-HELP explains the range of issues MLP attorneys help with: I = Income & Insurance; H=Housing & Utilities; E=Education & Employment; L=Legal Status; P=Personal & Family Stability./n/nThe project began November 2016. In the initial months, a memorandum of understanding between NMLA and FNCH was drafted, AmeriCorps legal fellows were trained, medical staff were trained to identify legal problems, and protocols for referral and services were developed. The first AmeriCorps legal fellow hired was not able to complete her commitment for personal reasons; legal fellow Katy Almond was recruited and began providing services in August 2017. Katy is supervised by the Director of NMLA’s Native American Program, Attorney Cindy Aragon. Katy is on site at FNCH doing new client intake one day a week and additionally as needed, and handles court appearances and completes case work from NMLA’s Santa Ana office in the rest of her fulltime schedule. A licensed attorney, Katy gathers documents and background information from clients, does legal research, provides counsel and advice to clients, assists them with self-help legal documents they can file on their own, and represents clients in administrative hearings and court hearings as needed. Katy and Cindy do project outreach to cooperating entities like the City of Albuquerque Commission on Indian Affairs, the Bernalillo County Metropolitan Court’s Healing to Wellness Program and Veterans' Court Program, and state agencies like NM Children, Youth & Families Dept./n/nThe project provides the community with a positive return on investment. Impact is demonstrated in improved patient well-being; increased training of health providers on social determinants and legal solutions; and health system cost savings as people’s needs are met through lower level prevention. To date more than 50 clients have been served with results like domestic protection orders obtained, Supplemental Nutrition Assistance Program (SNAP) benefits gained, debt mitigated, and eviction avoided."}, {"name": "Carrie Tingley Hospital Foundation ", "description": "The Patient and Family Assistance Program serves children with disabilities and their families by improving access to homes and the community. Through a network of collaborators, patients receive  wheelchair ramps, home and vehicle modifications, and therapeutic equipment not covered by insurance as well as limited emergency assistance."}, {"name": "Presbyterian Medical Services", "description": "Presbyterian Medical Services (PMS) designs and delivers quality, accessible, integrated health, education and human services in response to identified community needs of the multi-cultural people of the Southwest. (PMS is Not connected with Presbyterian Healthcare.) In Torrance County PMS serves food-insecure seniors ages 60 and over.  PMS operates three senior citizen nutrition sites there (in Moriarty; Mountainair & Estancia) along with home-delivered meals and Essential Transportation to food stores; medical appointments; pharmacies, etc.  PMS offers a literal lifeline to isolated, low-income individuals with so few social / community supports they are at risk of institutionalization./n/nPMS' Torrance County Seniors' Program serves 1 daily balanced meal at no cost to seniors at home or at 3 traditional Senior Citizen Centers - and more. Our mission: identify isolated county residents aged 60+, assess their food insecurity and link them to daily meals. This way, at-risk seniors may maintain financial stability & age-in-place at home"}, {"name": "Working Classroom", "description": ""}, {"name": "Presbyterian Ear Institute", "description": ""}, {"name": "St. Martin's HopeWorks", "description": "St. Martin’s HopeWorks was founded in 1985 as a day shelter, initially serving only meals. Project End Homelessness (PEH), a program of HopeWorks, began in response to the increasing number of homeless in Albuquerque. Providing critical needs isn’t enough—we must provide a 360 degree approach to ending homelessness, which includes basic needs, as well as mental/behavioral health, housing, and employment. Our innovation is why we are the largest provider of comprehensive services to those experiencing or at risk of homelessness in New Mexico."}, {"name": "Accion New Mexico", "description": "Accion and Koach’s vision for this program is to expand economic opportunity and equity for women entrepreneurs in Central New Mexico, who face greater hurdles to securing small business support than male entrepreneurs. This is a vital program in our state, where 20.4 percent of working-age women live in poverty, making it the fourth-worst state in the country for this outcome."}, {"name": "ReadWest Inc", "description": "Since 1989, ReadWest’s mission has been to provide quality one-to-one tutoring to adults seeking to transform their lives through enhanced literacy skills. ReadWest believes the ability to read and write is essential to economic self-sufficiency and personal well-being.  ReadWest exists to increase literacy skills for adults in Sandoval and Bernalillo Counties as the means of strengthening their economic and social opportunities. Trained volunteer tutors provide free, individualized, one-to-one and group reading, writing, computer literacy, GED Prep, and English language instruction to adults who are at level 2 or below on the National Adult Literacy Survey scale (below a 5th grade reading level) who aspire to improve their quality of life./n/nSince 1989 ReadWest’s mission is to provide quality one-to-one tutoring to adults seeking to transform their lives through enhanced literacy skills. ReadWest offers free instruction in Basic Reading, English Acquisition, GED Preparation, basic computer use, and U.S. Citizenship preparation to adults through trained, certified volunteer tutors."}, {"name": "Rio Grande Food Project", "description": "RGFP is the largest food pantry on ABQ’s west side, filling empty bellies since 1989. In ‘17 RGFP served 4,230 hungry kids, adults & seniors each month, distributing 1,119,134 lbs of groceries by year-end. Sadly, the need extends far beyond these numbers."}, {"name": "NM Black History Month Organizing Committee", "description": "The Roots Community Leadership Program is in its 7th year of programming. We offer a 3 week intensive summer leadership program and a four month fall/winter program for students aged 8 – 16. Students range in age from 8 to 16. The program fee is offered in a sliding scale to better meet economic restrictions of the low-moderate income student population. Most students attending the program utilizing a full scholarship that includes a parent volunteer requirement. Our fall/winter program that culminates in activities surrounding the NM Black History Festival in February is offered free of charge. All in all, we spend more than 400 hours with students over the course of a year. In 2013, NMBHOC launched The Roots Summer Leadership Academy, a comprehensive program which integrates an art-based curriculum with a unique counseling component under the direction of Dr. Stephanie McIver, Director of the UNM Student Health and Counseling Center. Arts curriculum can provide a particularly powerful tool to engage youth and spark their curiosity and commitment; enhance thinking and problem solving skills; set high standards of quality, success, and achievement. Each Roots program is inter-related and provides opportunities for students to make sustained and long term tangible contributions to the group and the community and be recognized for those contributions; promote constructive peer and mentor relations through teamwork, decision-making, and critique sessions. The Academy introduces students to skills necessary to participate in other Roots programming. Also, the Theater Apprenticeship facet specifically creates a working environment featuring clear roles and responsibilities; and allow risk-taking in a safe and supportive environment. YouthARTS, a well-established arts program knowledge base, has been conducting programs and collecting best practices of arts programs designed for at-risk populations since 1995. As a result they have decisively determined that arts programs enhance young peoples' attitudes about themselves and their futures and can increase academic achievement and decrease delinquent behavior. Self-esteem, a main tenant of Roots programming, is a critical component of student success academically as well as having significant impact on interpersonal relationships and behavior. The therapeutic counseling component, based on the Rosenberg Self-Esteem assessment, contributes to the programs ability to do what the National Education Associated calls contextualization, i.e., connect teaching and curriculum to the experiences, values, knowledge, and needs of students. The Roots programs address needs identified at the National level, as well as those we have identified at the local community level. With curriculum designed to address issues of effort/motivation, specifically creates opportunities for students to identify areas of weakness and strength, assisting students with the development of journaling and creating strategies for achievement of success across a broad spectrum of goals. Incorporating cultural history and education throughout its programming, The Roots Academy is closing this gap and working to widen its ability to have a greater impact on underserved low-moderate income students in New Mexico. The American Institutes for Research published a paper in 1994 by Barbara T. Bowman, which clearly articulates an existing educational gap here in New Mexico. “By ignoring the differences between children - their experiences, their beliefs, their traditional practices - schools limit their own ability to educate these children.” The Roots Academy holistic curriculum is designed to help students fully actualize their individual potential, to greater increase their contributions to the community overall."}, {"name": "Domestic Violence Resource Center (DVRC)", "description": "DVRC empowers victims and engages the community to break the cycle of domestic violence (DV). Our Victim Advocate Unit (VAU) provides crisis intervention, victim and legal advocacy, safety planning, emergency transportation, DV education, referrals and case management services for victims of DV, sexual assault and stalking."}, {"name": "Healing Addiction in our Community", "description": "Healing Addiction in Our Community (HAC) is a non-profit 501c3  dedicated to awareness, education and treatment for young people struggling with addiction. HAC operates an adolescent treatment program called Serenity Mesa Youth Recovery Center. Serenity Mesa provides long-term sober living, therapy (individual, group, and family), life skills, high school classes and GED prep., college classes, job readiness, interview skills and resume writing, health and wellness, meditation, mindfulness activities, yoga and other recovery-based programming for youth age 14-21. Our goal is that each resident leave our program with the skills & tools needed to live a productive life free of drugs and alcohol./n/nSerenity Mesa is a substance abuse treatment center that provides transitional living & recovery services for young people ages 14-21. Serenity Mesa is operated by a non-profit organization called Healing Addiction in Our Community (HAC). HAC is a community group that provides awareness, education, and support regarding substance abuse issues in NM"}, {"name": "Supportive Housing Coalition of New Mexico", "description": "Supportive Housing Coalition of New Mexico (SHC-NM) provides a Service Coordination program to tenants at our affordable housing apartment complexes and to participants in the housing voucher programs we manage for the U.S. Department of Housing and Urban Development (HUD). The majority of participants in our housing programs have very low incomes or no income, a behavioral health disability and/or a chronic physical health issue, and have experienced homelessness with many fitting the HUD definition of chronic homelessness (continuously homeless for at least 12 months or having at least 4 episodes of homelessness in the past 3 years). These men and women experiencing chronic homelessness commonly have a combination of mental health problems, substance use disorders, and medical conditions that worsen over time and too often lead to an early death. It is estimated that at least 20% experience mental illness, 25% have some form of physical disability, and 40% have a substance abuse disorder; often, individuals have more than one of these conditions."}, {"name": "NewLife Homes", "description": "The Supportive Services Program will staff one full-time and one part-time staff member to serve as a lifeline for 350 NewLife Homes residents."}, {"name": "Albuquerque Speech, Language & Hearing", "description": "Albuquerque Speech Language and Hearing Center’s (ASLHC) mission is to improve the quality of life in the areas of hearing and speech-language pathology for persons of all ages and income levels. This mission is achieved in several ways. One way, is to provide services to our low income Medicaid qualified patients. In 2017, ASLHC dispensed 106 hearing aids and repaired/maintained 404 hearing aids for New Mexico Medicaid beneficiaries. ASLHC absorbed $36,782 of the cost associated with dispensing these hearing aids. Reimbursement from Medicaid is $300 per hearing aid. However, the actual cost to dispense these aids is $647 per unit. Another way we contribute to our community is to provide free speech and hearing screenings at local preschools and daycares.  In 2017, we provided 717 children with screenings. Each audiologist and speech pathologist dedicated 120 hours to these screenings. By providing these services we ensured these children did not go undiagnosed with a communication disorder. As a Social Enterprise fulfilling our mission, we sustain these expenditures by providing treatment to our patients who have adequate health insurance or who have the financial means to cover the cost of treatment. Over the past 65 years our reputation has advanced in the community. It has made us a prodigious referral source for physicians, ENTs and for profit audiologists./n/nUnfortunately, there is still a rather important population that we can’t diagnose and treat their hearing loss without help from an external funder. They are the low-income elderly individuals in our community. These people have taken care of their own needs throughout their life. It is only now that they need our help. These people make just enough in retirement or other income to push them out of the Medicaid safety net. For most elderly, Medicare, which does not pay for hearing aids, is their only insurance or they have an inadequate insurance plan with little or no coverage for hearing loss.  For 65 years, our Hearing Aid Bank (HAB) has helped improve the quality of life for our senior population by enabling them to get hearing aids. We have achieved this through funding from United Way of Central New Mexico and funds earned at our annual gala.  "}, {"name": "The Storehouse NM", "description": "Storehouse New Mexico is more than just a food pantry; it is an established resource connecting thousands of working families, children, people with disabilities, and seniors with free nutrition and supportive services to improve their overall health and financial well-being. Our mission is to help control food insecurities so more hungry people can live healthier lives."}, {"name": "PB&J Family Services", "description": ""}, {"name": "New Mexico Asian Family Center", "description": "New Mexico Asian Family Center (NMAFC) is the only agency in NM tailoring services for pan-Asian communities.  Our UAF program has evolved from previous years and will this year focus on providing resources to those most vulnerable within our community to help meet their basic needs.  UAF aims to elevate the number of Asian families that have quality access to resources through the provision of case management services around issues such as housing, healthcare, and public benefits including WIC (Women, Infant, and Children food and nutrition service) and TANF (temporary assistance for needy families).  These services are some of the most sought after within our Asian community, and are often the most inaccessible due to the complexity of navigating these systems as well as the lack of culturally and linguistically tailored support available within mainstream agencies.  "}, {"name": "Valencia County Literacy Council", "description": "Founded in 1987, Valencia County Literacy Council (VCLC) is now in its 31st year of providing help and hope to residents of Valencia County.  In the Valencia Literacy Program, we provide volunteer tutoring for adults 16 and over, not enrolled in public school, in Basic Reading, English for Speakers of Other Languages (ESL), Math, Citizenship, and pre-high school equivalency test studies.  In the El Cerro Mission area of our county, our literacy-based childcare also provides the opportunity for adults to attend literacy classes provided by both the Adult Basic Education (ABE) Department at the University of New Mexico-Valencia Campus (UNM-Valencia) as well as sessions with two of our tutors, Dr. Patricia Sanchez-Flavian and Dr. Byrd Gibbons.  In addition, in local low-income medical clinics in Valencia County, we provide volunteers to read to children and free children’s books to some of these same families, who often have few or no books at home.  "}, {"name": "Valencia Shelter for Victims of Domestic Violence", "description": "Valencia Shelter Services helps individuals affected by domestic violence, sexual assault, & child abuse in their efforts to move their lives forward. We provide shelter, housing, counseling,& advocacy to support them in building lives free from the effects of violence. We seek social change to end domestic violence, sexual, assault, & child abuse."}, {"name": "Wings for LIFE International", "description": "Wings For L.I.F.E. - Life-skills Imparted to Families through Education (WFL) is a Nat'l & State Best Practice Model & has won:"}, {"name": "New Mexico Philharmonic", "description": ""}]
